======================
Incomplete transaction
======================

2024-01-02 shopping  ; event

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (comment))))

=======================
Simple transaction test
=======================

2024-01-02 shopping
    expenses: clothing        1 G
    pouch

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity)))
            (posting
                (account)))))

================
Transaction test
================

2024-01-02 shopping     ; comment
    ; dnd transaction
    expenses: clothing        1 gold
    pouch

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (comment)
            (posting
                (comment))
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity)))
            (posting
                (account)))))

==================================
Transaction test - posting comment
==================================

2024-01-02 shopping
    ; dnd transaction
    expenses: clothing        1 gold  ; plate armor
    pouch

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (posting
                (comment))
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity))
                (comment))
            (posting
                (account)))))

================================
Transaction test - more postings
================================

2024-01-02 shopping
    expenses:clothing        1 gold
    expenses:wands           5 gold
    assets:pouch            -6 gold

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity)))
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity)))
            (posting
                (account)
                (amount
                    (neg_quantity)
                    (commodity))))))

==========================
Transaction test - heading
==========================

2024-01-03 ! (12345) pay rent
    ; Additional transaction comment lines, indented.
    ; There can be a ! or * after the date meaning "pending" or "cleared".
    ; There can be a parenthesised (code) after the date/status.
                                    ; Amounts' sign shows direction of flow.
    assets:checking          $-500  ; Minus means removed from this account (credit).
    expenses:rent             $500  ; Plus means added to this account (debit).

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (status)
                (code)
                (note))
            (posting
                (comment))
            (posting
                (comment))
            (posting
                (comment))
            (posting
                (comment))
            (posting
                (account)
                (amount
                    (commodity)
                    (neg_quantity))
                    (comment))
            (posting
                (account)
                (amount
                    (commodity)
                    (quantity))
                    (comment)))))


=======================
Transaction test - cost
=======================

2024-01-15 buy some shares, in two lots                 ; Cost can be noted.
    assets:investments:2024-01-15     2.0 AAAA @ $1.50  ; @  means per-unit cost
    assets:investments:2024-01-15-02  3.0 AAAA @@ $4    ; @@ means total cost
                      ; ^ Per-lot subaccounts are sometimes useful.
    assets:checking                 $-7

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (comment)
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity))
                (cost)
                (amount
                    (commodity)
                    (quantity))
                (comment))
            (posting
                (account)
                (amount
                    (quantity)
                    (commodity))
                (cost)
                (amount
                    (commodity)
                    (quantity))
                (comment))
            (posting
                (comment))
            (posting
                (account)
                (amount
                    (commodity)
                    (neg_quantity))))))

=========================
Transaction test - assert
=========================

2024-01-15 assert some account balances on this date
    assets:savings                    $0 = $10000

---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (posting
                (account)
                (amount
                    (commodity)
                    (quantity))
                (assert)
                (amount
                    (commodity)
                    (quantity))))))

=========================
Transaction test - assert
=========================

2024-01-15 assert some account balances on this date
    ; Balances can be asserted in any transaction, with =, for extra error checking.
    ; Assertion txns like this one can be made with hledger close --assert --show-costs
    ;
    assets:savings                    $0                   = $10000
    assets:checking                   $0                   =   $493
    assets:bank:gold                   0 gold              =    -10 gold
    assets:pouch                       0 gold              =      4 gold
    assets:pouch                       0 "Chocolate Frogs" =      3 "Chocolate Frogs"
    assets:investments:2024-01-15      0.0 AAAA            =      2.0 AAAA @  $1.50
    assets:investments:2024-01-15-02   0.0 AAAA            =      3.0 AAAA @@ $4
    liabilities:credit card           $0                   =  $-500

---

(source_file
    (journal_item
    (transaction
        (transaction_heading
            (date)
            (note))
        (posting
            (comment))
        (posting
            (comment))
        (posting
            (comment))
        (posting
            (account)
        (amount
            (commodity)
            (quantity))
        (assert)
        (amount
            (commodity)
            (quantity)))
        (posting
        (account)
        (amount
            (commodity)
            (quantity))
        (assert)
        (amount
            (commodity)
            (quantity)))
        (posting
        (account)
        (amount
            (quantity)
            (commodity))
        (assert)
        (amount
            (neg_quantity)
            (commodity)))
        (posting
        (account)
        (amount
            (quantity)
            (commodity))
        (assert)
        (amount
            (quantity)
            (commodity)))
        (posting
        (account)
        (amount
            (quantity)
            (commodity))
        (assert)
        (amount
            (quantity)
            (commodity)))
        (posting
        (account)
        (amount
            (quantity)
            (commodity))
        (assert)
        (amount
            (quantity)
            (commodity))
        (cost)
        (amount
            (commodity)
            (quantity)))
        (posting
        (account)
        (amount
            (quantity)
            (commodity))
        (assert)
        (amount
            (quantity)
            (commodity))
        (cost)
        (amount
            (commodity)
            (quantity)))
        (posting
        (account)
        (amount
            (commodity)
            (quantity))
        (assert)
        (amount
            (commodity)
            (neg_quantity))))))

==============================
Transaction test - tag comment
==============================

2017/1/16 bought groceries      ; transactiontag:
    ; test note with tag transactiontag2:, the tag has no value
    assets:checking        $-1
---

(source_file
    (journal_item
        (transaction
            (transaction_heading
                (date)
                (note))
            (comment
                (tag_value
                    (tag)))
            (posting
                (comment
                    (tag_value
                        (tag))))
            (posting
                (account)
                (amount
                    (commodity)
                    (neg_quantity))))))
